PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16lf1779.inc
DACOE2           EQU  H'0004'
DACOE1           EQU  H'0005'
DACEN            EQU  H'0007'

DACNSS0          EQU  H'0000'
DACNSS1          EQU  H'0001'
DACPSS0          EQU  H'0002'
DACPSS1          EQU  H'0003'

DAC8OE2          EQU  H'0004'
DAC8OE1          EQU  H'0005'
DAC8EN           EQU  H'0007'

DAC8NSS0         EQU  H'0000'
DAC8NSS1         EQU  H'0001'
DAC8PSS0         EQU  H'0002'
DAC8PSS1         EQU  H'0003'


;----- DAC8CON1 Bits -----------------------------------------------------
DACR0            EQU  H'0000'
DACR1            EQU  H'0001'
DACR2            EQU  H'0002'
DACR3            EQU  H'0003'
DACR4            EQU  H'0004'

R0               EQU  H'0000'
R1               EQU  H'0001'
R2               EQU  H'0002'
R3               EQU  H'0003'
R4               EQU  H'0004'


DAC8R0           EQU  H'0000'
DAC8R1           EQU  H'0001'
DAC8R2           EQU  H'0002'
DAC8R3           EQU  H'0003'
DAC8R4           EQU  H'0004'

REF0             EQU  H'0000'
REF1             EQU  H'0001'
REF2             EQU  H'0002'
REF3             EQU  H'0003'
REF4             EQU  H'0004'

DAC8REF0         EQU  H'0000'
DAC8REF1         EQU  H'0001'
DAC8REF2         EQU  H'0002'
DAC8REF3         EQU  H'0003'
DAC8REF4         EQU  H'0004'


;----- DAC8REF Bits -----------------------------------------------------
DACR0            EQU  H'0000'
DACR1            EQU  H'0001'
DACR2            EQU  H'0002'
DACR3            EQU  H'0003'
DACR4            EQU  H'0004'

R0               EQU  H'0000'
R1               EQU  H'0001'
R2               EQU  H'0002'
R3               EQU  H'0003'
R4               EQU  H'0004'


DAC8R0           EQU  H'0000'
DAC8R1           EQU  H'0001'
DAC8R2           EQU  H'0002'
DAC8R3           EQU  H'0003'
DAC8R4           EQU  H'0004'

REF0             EQU  H'0000'
REF1             EQU  H'0001'
REF2             EQU  H'0002'
REF3             EQU  H'0003'
REF4             EQU  H'0004'

DAC8REF0         EQU  H'0000'
DAC8REF1         EQU  H'0001'
DAC8REF2         EQU  H'0002'
DAC8REF3         EQU  H'0003'
DAC8REF4         EQU  H'0004'


;----- PRG4RTSS Bits -----------------------------------------------------
RTSS0            EQU  H'0000'
RTSS1            EQU  H'0001'
RTSS2            EQU  H'0002'
RTSS3            EQU  H'0003'

RG4RTSS0         EQU  H'0000'
RG4RTSS1         EQU  H'0001'
RG4RTSS2         EQU  H'0002'
RG4RTSS3         EQU  H'0003'


;----- PRG4FTSS Bits -----------------------------------------------------
FTSS0            EQU  H'0000'
FTSS1            EQU  H'0001'
FTSS2            EQU  H'0002'
FTSS3            EQU  H'0003'

RG4FTSS0         EQU  H'0000'
RG4FTSS1         EQU  H'0001'
RG4FTSS2         EQU  H'0002'
RG4FTSS3         EQU  H'0003'


;----- PRG4INS Bits -----------------------------------------------------
INS0             EQU  H'0000'
INS1             EQU  H'0001'
INS2             EQU  H'0002'
INS3             EQU  H'0003'

RG4INS0          EQU  H'0000'
RG4INS1          EQU  H'0001'
RG4INS2          EQU  H'0002'
RG4INS3          EQU  H'0003'


;----- PRG4CON0 Bits -----------------------------------------------------
GO_PRG4CON0      EQU  H'0000'
OS               EQU  H'0001'
REDG             EQU  H'0004'
FEDG             EQU  H'0005'
EN               EQU  H'0007'

MODE0_PRG4CON0   EQU  H'0002'
MODE1_PRG4CON0   EQU  H'0003'

RG4GO            EQU  H'0000'
RG4OS            EQU  H'0001'
RG4REDG          EQU  H'0004'
RG4FEDG          EQU  H'0005'
RG4EN            EQU  H'0007'

RG4MODE0         EQU  H'0002'
RG4MODE1         EQU  H'0003'


;----- PRG4CON1 Bits -----------------------------------------------------
RPOL             EQU  H'0000'
FPOL             EQU  H'0001'
RDY              EQU  H'0002'

RG4RPOL          EQU  H'0000'
RG4FPOL          EQU  H'0001'
RG4RDY           EQU  H'0002'


;----- PRG4CON2 Bits -----------------------------------------------------
ISET0            EQU  H'0000'
ISET1            EQU  H'0001'
ISET2            EQU  H'0002'
ISET3            EQU  H'0003'
ISET4            EQU  H'0004'


RG4ISET0         EQU  H'0000'
RG4ISET1         EQU  H'0001'
RG4ISET2         EQU  H'0002'
RG4ISET3         EQU  H'0003'
RG4ISET4         EQU  H'0004'


;----- PWM3DCL Bits -----------------------------------------------------
DC0              EQU  H'0006'
DC1              EQU  H'0007'

PWM3DC0          EQU  H'0006'
PWM3DC1          EQU  H'0007'

PWMPW0           EQU  H'0006'
PWMPW1           EQU  H'0007'


;----- PWM3DCH Bits -----------------------------------------------------
DC2              EQU  H'0000'
DC3              EQU  H'0001'
DC4              EQU  H'0002'
DC5              EQU  H'0003'
DC6              EQU  H'0004'
DC7              EQU  H'0005'
DC8              EQU  H'0006'
DC9              EQU  H'0007'

PWM3DC2          EQU  H'0000'
PWM3DC3          EQU  H'0001'
PWM3DC4          EQU  H'0002'
PWM3DC5          EQU  H'0003'
PWM3DC6          EQU  H'0004'
PWM3DC7          EQU  H'0005'
PWM3DC8          EQU  H'0006'
PWM3DC9          EQU  H'0007'

PWMPW2           EQU  H'0000'
PWMPW3           EQU  H'0001'
PWMPW4           EQU  H'0002'
PWMPW5           EQU  H'0003'
PWMPW6           EQU  H'0004'
PWMPW7           EQU  H'0005'
PWMPW8           EQU  H'0006'
PWMPW9           EQU  H'0007'


;----- PWM3CON Bits -----------------------------------------------------
POL_PWM3CON      EQU  H'0004'
OUT_PWM3CON      EQU  H'0005'
EN               EQU  H'0007'

PWM3POL          EQU  H'0004'
PWM3OUT          EQU  H'0005'
PWM3EN           EQU  H'0007'


;----- PWM4DCL Bits -----------------------------------------------------
DC0              EQU  H'0006'
DC1              EQU  H'0007'

PWM4DC0          EQU  H'0006'
PWM4DC1          EQU  H'0007'

PWMPW0           EQU  H'0006'
PWMPW1           EQU  H'0007'


;----- PWM4DCH Bits -----------------------------------------------------
DC2              EQU  H'0000'
DC3              EQU  H'0001'
DC4              EQU  H'0002'
DC5              EQU  H'0003'
DC6              EQU  H'0004'
DC7              EQU  H'0005'
DC8              EQU  H'0006'
DC9              EQU  H'0007'

PWM4DC2          EQU  H'0000'
PWM4DC3          EQU  H'0001'
PWM4DC4          EQU  H'0002'
PWM4DC5          EQU  H'0003'
PWM4DC6          EQU  H'0004'
PWM4DC7          EQU  H'0005'
PWM4DC8          EQU  H'0006'
PWM4DC9          EQU  H'0007'

PWMPW2           EQU  H'0000'
PWMPW3           EQU  H'0001'
PWMPW4           EQU  H'0002'
PWMPW5           EQU  H'0003'
PWMPW6           EQU  H'0004'
PWMPW7           EQU  H'0005'
PWMPW8           EQU  H'0006'
PWMPW9           EQU  H'0007'


