PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p16lf1779.inc
G4BLKF0          EQU  H'0000'
G4BLKF1          EQU  H'0001'
G4BLKF2          EQU  H'0002'
G4BLKF3          EQU  H'0003'
G4BLKF4          EQU  H'0004'
G4BLKF5          EQU  H'0005'


;----- COG4DBR Bits -----------------------------------------------------
DBR0             EQU  H'0000'
DBR1             EQU  H'0001'
DBR2             EQU  H'0002'
DBR3             EQU  H'0003'
DBR4             EQU  H'0004'
DBR5             EQU  H'0005'

G4DBR0           EQU  H'0000'
G4DBR1           EQU  H'0001'
G4DBR2           EQU  H'0002'
G4DBR3           EQU  H'0003'
G4DBR4           EQU  H'0004'
G4DBR5           EQU  H'0005'


;----- COG4DBF Bits -----------------------------------------------------
DBF0             EQU  H'0000'
DBF1             EQU  H'0001'
DBF2             EQU  H'0002'
DBF3             EQU  H'0003'
DBF4             EQU  H'0004'
DBF5             EQU  H'0005'

G4DBF0           EQU  H'0000'
G4DBF1           EQU  H'0001'
G4DBF2           EQU  H'0002'
G4DBF3           EQU  H'0003'
G4DBF4           EQU  H'0004'
G4DBF5           EQU  H'0005'



;----- COG4CON0 Bits -----------------------------------------------------
LD               EQU  H'0006'
EN               EQU  H'0007'

MD0              EQU  H'0000'
MD1              EQU  H'0001'
MD2              EQU  H'0002'
CS0_COG4CON0     EQU  H'0003'
CS1_COG4CON0     EQU  H'0004'

G4LD             EQU  H'0006'
G4EN             EQU  H'0007'

G4MD0            EQU  H'0000'
G4MD1            EQU  H'0001'
G4MD2            EQU  H'0002'
G4CS0            EQU  H'0003'
G4CS1            EQU  H'0004'


;----- COG4CON1 Bits -----------------------------------------------------
POLA             EQU  H'0000'
POLB             EQU  H'0001'
POLC             EQU  H'0002'
POLD             EQU  H'0003'
FDBS             EQU  H'0006'
RDBS             EQU  H'0007'

G4POLA           EQU  H'0000'
G4POLB           EQU  H'0001'
G4POLC           EQU  H'0002'
G4POLD           EQU  H'0003'
G4FDBS           EQU  H'0006'
G4RDBS           EQU  H'0007'


;----- COG4RIS0 Bits -----------------------------------------------------
RIS0             EQU  H'0000'
RIS1             EQU  H'0001'
RIS2             EQU  H'0002'
RIS3             EQU  H'0003'
RIS4             EQU  H'0004'
RIS5             EQU  H'0005'
RIS6             EQU  H'0006'
RIS7             EQU  H'0007'

G4RIS0           EQU  H'0000'
G4RIS1           EQU  H'0001'
G4RIS2           EQU  H'0002'
G4RIS3           EQU  H'0003'
G4RIS4           EQU  H'0004'
G4RIS5           EQU  H'0005'
G4RIS6           EQU  H'0006'
G4RIS7           EQU  H'0007'


;----- COG4RIS1 Bits -----------------------------------------------------
RIS8             EQU  H'0000'
RIS9             EQU  H'0001'
RIS10            EQU  H'0002'
RIS11            EQU  H'0003'
RIS12            EQU  H'0004'
RIS13            EQU  H'0005'
RIS14            EQU  H'0006'
RIS15            EQU  H'0007'

G4RIS8           EQU  H'0000'
G4RIS9           EQU  H'0001'
G4RIS10          EQU  H'0002'
G4RIS11          EQU  H'0003'
G4RIS12          EQU  H'0004'
G4RIS13          EQU  H'0005'
G4RIS14          EQU  H'0006'
G4RIS15          EQU  H'0007'


;----- COG4RSIM0 Bits -----------------------------------------------------
RSIM0            EQU  H'0000'
RSIM1            EQU  H'0001'
RSIM2            EQU  H'0002'
RSIM3            EQU  H'0003'
RSIM4            EQU  H'0004'
RSIM5            EQU  H'0005'
RSIM6            EQU  H'0006'
RSIM7            EQU  H'0007'

G4RSIM0          EQU  H'0000'
G4RSIM1          EQU  H'0001'
G4RSIM2          EQU  H'0002'
G4RSIM3          EQU  H'0003'
G4RSIM4          EQU  H'0004'
G4RSIM5          EQU  H'0005'
G4RSIM6          EQU  H'0006'
G4RSIM7          EQU  H'0007'


;----- COG4RSIM1 Bits -----------------------------------------------------
RSIM8            EQU  H'0000'
RSIM9            EQU  H'0001'
RSIM10           EQU  H'0002'
RSIM11           EQU  H'0003'
RSIM12           EQU  H'0004'
RSIM13           EQU  H'0005'
RSIM14           EQU  H'0006'
RSIM15           EQU  H'0007'

G4RSIM8          EQU  H'0000'
G4RSIM9          EQU  H'0001'
G4RSIM10         EQU  H'0002'
G4RSIM11         EQU  H'0003'
G4RSIM12         EQU  H'0004'
G4RSIM13         EQU  H'0005'
G4RSIM14         EQU  H'0006'
G4RSIM15         EQU  H'0007'


;----- COG4FIS0 Bits -----------------------------------------------------
FIS0             EQU  H'0000'
FIS1             EQU  H'0001'
FIS2             EQU  H'0002'
FIS3             EQU  H'0003'
FIS4             EQU  H'0004'
FIS5             EQU  H'0005'
FIS6             EQU  H'0006'
FIS7             EQU  H'0007'

G4FIS0           EQU  H'0000'
G4FIS1           EQU  H'0001'
G4FIS2           EQU  H'0002'
G4FIS3           EQU  H'0003'
G4FIS4           EQU  H'0004'
G4FIS5           EQU  H'0005'
G4FIS6           EQU  H'0006'
G4FIS7           EQU  H'0007'


;----- COG4FIS1 Bits -----------------------------------------------------
FIS8             EQU  H'0000'
FIS9             EQU  H'0001'
FIS10            EQU  H'0002'
FIS11            EQU  H'0003'
FIS12            EQU  H'0004'
FIS13            EQU  H'0005'
FIS14            EQU  H'0006'
FIS15            EQU  H'0007'

G4FIS8           EQU  H'0000'
G4FIS9           EQU  H'0001'
G4FIS10          EQU  H'0002'
G4FIS11          EQU  H'0003'
G4FIS12          EQU  H'0004'
G4FIS13          EQU  H'0005'
G4FIS14          EQU  H'0006'
G4FIS15          EQU  H'0007'


;----- COG4FSIM0 Bits -----------------------------------------------------
FSIM0            EQU  H'0000'
FSIM1            EQU  H'0001'
FSIM2            EQU  H'0002'
FSIM3            EQU  H'0003'
FSIM4            EQU  H'0004'
FSIM5            EQU  H'0005'
FSIM6            EQU  H'0006'
FSIM7            EQU  H'0007'

G4FSIM0          EQU  H'0000'
G4FSIM1          EQU  H'0001'
G4FSIM2          EQU  H'0002'
G4FSIM3          EQU  H'0003'
G4FSIM4          EQU  H'0004'
G4FSIM5          EQU  H'0005'
G4FSIM6          EQU  H'0006'
G4FSIM7          EQU  H'0007'


;----- COG4FSIM1 Bits -----------------------------------------------------
FSIM8            EQU  H'0000'
FSIM9            EQU  H'0001'
FSIM10           EQU  H'0002'
FSIM11           EQU  H'0003'
FSIM12           EQU  H'0004'
FSIM13           EQU  H'0005'
FSIM14           EQU  H'0006'
FSIM15           EQU  H'0007'

G4FSIM8          EQU  H'0000'
G4FSIM9          EQU  H'0001'
G4FSIM10         EQU  H'0002'
G4FSIM11         EQU  H'0003'
G4FSIM12         EQU  H'0004'
G4FSIM13         EQU  H'0005'
G4FSIM14         EQU  H'0006'
G4FSIM15         EQU  H'0007'


;----- COG4ASD0 Bits -----------------------------------------------------
ASREN            EQU  H'0006'
ASE              EQU  H'0007'

ASDAC0           EQU  H'0002'
ASDAC1           EQU  H'0003'
ASDBD0           EQU  H'0004'
ASDBD1           EQU  H'0005'
ARSEN            EQU  H'0006'

G4ARSEN          EQU  H'0006'
G4ASE            EQU  H'0007'

G4ASDAC0         EQU  H'0002'
G4ASDAC1         EQU  H'0003'
G4ASDBD0         EQU  H'0004'
G4ASDBD1         EQU  H'0005'
G4ASREN          EQU  H'0006'


;----- COG4ASD1 Bits -----------------------------------------------------
AS0E             EQU  H'0000'
AS1E             EQU  H'0001'
AS2E             EQU  H'0002'
AS3E             EQU  H'0003'
AS4E             EQU  H'0004'
AS5E             EQU  H'0005'
AS6E             EQU  H'0006'
AS7E             EQU  H'0007'

G4AS0E           EQU  H'0000'
G4AS1E           EQU  H'0001'
G4AS2E           EQU  H'0002'
G4AS3E           EQU  H'0003'
G4AS4E           EQU  H'0004'
G4AS5E           EQU  H'0005'
G4AS6E           EQU  H'0006'
G4AS7E           EQU  H'0007'


;----- COG4STR Bits -----------------------------------------------------
STRA             EQU  H'0000'
STRB             EQU  H'0001'
STRC             EQU  H'0002'
STRD             EQU  H'0003'
SDATA            EQU  H'0004'
SDATB            EQU  H'0005'
SDATC            EQU  H'0006'
SDATD            EQU  H'0007'

